30-rails-api/movies-api/app/controllers/api/v1/movies_controller.rb

  def index
    movies = Movie.all.sort_by { |movie| movie.title }
---
SELECT "movies".* FROM "movies"

  def update
    movie = Movie.find(params[:id])
    movie.update(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "movies" SET "score" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["score", 1], ["updated_at", "2020-02-24 17:10:52.800092"], ["id", 7]]

  def destroy
    movie = Movie.find(params[:id])

    movie.destroy
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 4]]

  def create
    movie = Movie.create(movie_params)
---
INSERT INTO "movies" ("year", "title", "score", "imageUrl", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"